Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: Weil die 'add' Anweisung Dateien in die Git Datenbank befördert und die Dateistatusinformationen aktualisiert, während die 'commit' Anweisung, ohne Optionen, einen 'Commit' nur auf Basis der Dateistatusinformationen erzeugt, weil die Dateien ja schon in der Datenbank sind.
pl: Ponieważ polecenie 'add' transportuje pliki do bazy danych Git i aktualizuje informacje o ich statusie, podczas gdy polecenie 'commit' (bez opcji) tworzy commit tylko wyłącznie na podstawie informacji o statusie plików, ponieważ pliki te już sie w tej bazie znajdują.

source: Welche Lösung ist die beste?
pl: Ktore rozwiazanie jest najlepsze?

source: Wenn Anwender langsame Anweisungen ausführen müssen, sinkt die Produktivität, da der Arbeitsfluss unterbrochen wird.
pl: Jeśli użytkownicy są zmuszeni do wykonywania powolnych poleceń, produktywność spada, ponieważ przerywany zostaje ciąg pracy.

source: Wenn Dein Projekt sehr groß ist und viele Dateien enthält, die in keinem direkten Bezug stehen, trotzdem aber häufig geändert werden, kann Git nachteiliger sein als andere Systeme, weil es keine einzelnen Dateien überwacht.
pl: Jeśli twój projekt jest bardzo duży i zawiera wiele plików, które nie są bezpośrednio ze sobą powiązane, mimo to jednak często zostają zmieniane, Git może tu oddziaływać bardziej negatywnie niż to jest w innych systemach, ponieważ nie prowadzi monitoringu poszczególnych plików.

source: Wenn Du 'filter-branch' aufrufst, bekommst Du alte Objekte, welche nicht länger benötigt werden.
pl: Jeśli użyjesz polecenia 'filter-branch', otrzymasz stare objekty, które nie są już używane.

source: Wenn Du den SHA1 Schlüssel vom originalen HEAD hast, dann:
pl: Jeśli posiadasz klucz SHA1 orginalnego 'HEAD', wtedy możesz wrócić komendą:

source: Wenn Du ein 'Repository' 'clonst', 'clonst' Du auch alle seine 'Branches'.
pl: Jeśli klonujesz repozytorium, klonujesz równierz wszystkie jego 'branches'

source: Wenn Du ein sauberes 'Repository' willst, ist es am besten, einen neuen Klon anzulegen.
pl: Jeśli chcesz posiadać czyste repozytorium, to najlepiej załóż nowy klon.

source: Wenn Du sicher bist, dass alle unversionierten Dateien und Verzeichnisse entbehrlich sind, dann lösche diese gnadenlos mit:
pl: Jeśli jesteś pewny, że wszystkie niezwersjonowane pliki i katalogi są zbędne, skasujesz je bezlitośnie poleceniem:

source: Wenn Du zufrieden bist, gib
pl: Jeśli jesteś zadowolony z wyniku, wpisz:

source: Wenn Spieler vom Hauptserver herunterladen, erhalten sie jedes gespeichertes Spiel, nicht nur das zuletzt gespeicherte.
pl: Jeśli gracze ładują teraz z serwera, otrzymują każdy zapisany stan, nie tylko ostatnio zapisany

source: Wenn alle 'Repositories' geschlossen sind, ist es unnötig den Git Dämon laufen zu lassen, da jegliche Kommunikation über SSH läuft.
pl: Jeśli wszystkie REPOSITORIES są zamknięte, nie ma potrzeby startować deamon GIT, ponieważ cała komunikacja odbywa się za pomocą SSH.

source: Wenn auch nicht so effizient wie mit dem systemeigenen Protokoll, kann Git über HTTP kommunizieren.
pl: Nawet, jeśli jest to mniej efektywne jak własny protokół git, git potrafi komunikować się przez HTTP.

source: Wenn das original 'Repository' verschoben wird, können wir die URL aktualisieren mit:
pl: Jeśli orginalne repozytorium zostanie przesunięte, możemy zaktualizować link poprzez:

source: Wenn dein Projekt nicht so bekannt ist, finde so viele Server wie du kannst um dort einen 'Clone' zu platzieren.
pl: Jeśli twój projekt nie jest zbyt mocno znany, spróbuj pozyskać tak wiele serwerów ile to możliwe, by umieścić tam klon

source: Wenn dein Projekt viele Entwickler hat, musst du nichts tun!
pl: Jeśli projekt posiada wielu programistów, nie musisz niczego robić

source: Wenn die Dateien sich tatsächlich konstant verändern und sie wirklich versioniert werden müssen, ist es eine Möglichkeit Git in zentralisierter Form zu verwenden.
pl: Jeśli dane ulegają ciągłym zmianom i naprawdę muszą być wersjonowane, jedną z możliwości jest zastosowanie Git w scentralizowanej formie.

source: Wenn du Dateien oder Verzeichnisse hinzufügst, musst du Git das mitteilen:
pl: Jesli dodales nowe pliki, musisz o tym poinformowac GIT

source: Wenn du Glück hast oder sehr gut bist, kannst du die nächsten Zeilen überspringen.
pl: Jeśli masz szczęście i jesteś dobry, możesz ominąć następne akapity.

source: Wenn du aber Änderungen hast, wird Git diese automatisch 'mergen' und dir Konflikte melden.
pl: Jesli jednak wprowadziles zmiany, Git bedzie je automatycznie 'merge' i powiadomi cie o eventualnych konfliktach.

source: Wenn du deine Ermittlungen abgeschlossen hast, kehre zum Originalstand zurück mit:
pl: Po skończeniu dochodzenia przejdź do orginalnego stanu:

source: Wenn du einen 'Commit' mit 'edit' markiert hast, gib ein:
pl: Jeśli zaznaczyłeś jakiś 'commit' poprzez 'edit', wpisz:

source: Wenn du fertig bist,
pl: A gdy skończysz:

source: Wenn du gut voran gekommen bist, willst du das Erreichte sichern.
pl: Jeśli dobrze ci poszło, chciałabyś zabezpieczyć to co udało ci się osiągnąć.

source: Wenn du keine lokalen Änderungen hast, dann ist 'merge' eine 'schnelle Weiterleitung', ein Ausnahmefall, ähnlich dem Abrufen der letzten Version eines zentralen Versionsverwaltungssystems.
pl: Jesli nie wprowadziles zadnych lokalnych zmian, to 'merge' jest szybkim przekierowaniem, jest to przypadek, podobny do przywolania ostatniej wersji z centralnego systemu kontroli wersji.

source: Wenn du nun eine alte Version erhalten willst, musst du den ganzen Ordner archivieren.
pl: Jeśli chcesz otrzymać starszą wersję musisz archiwizować cały katalog.

source: Wenn du schon eine Kopie eines Projektes hast, kannst du es auf die neuste Version aktualisieren mit:
pl: Jeśli posiadasz już kopię projektu, możesz ją zaktualizować poleceniem:

source: Wenn du wieder zurück zu deinen Änderungen willst, tippe:
pl: Jeśli chcesz powrócić spowrotem do swoich zmian, wpisz:

source: Wenn ein Spieler einen Fortschritt machen wollte, musste er den aktuellsten Stand vom Hauptserver herunterladen, eine Weile spielen, sichern und den Stand dann wieder auf den Server laden, damit irgendjemand ihn nutzen kann.
pl: Jeśli jakiś gracz chciał popchać grę trochę do przodu, musiał najpierw zładować ze serwera aktualny stan, trochę pograć, zapisać własny stan, a następnie załadować na serwer, by mógł go wykorzystać ktoś inny.

source: Wenn es bei Dir nicht funktioniert, versuche Optionen zur aufwendigeren Erkennung von Kopien oder erwäge einen Upgrade.
pl: Jeśli to u ciebie nie działa, spróbuj poszukać opcji rozszerzonego rozpoznawania kopii, aktualizacja samegi Git, też może pomóc.

source: Wenn es mit einem der bekannteren Systeme verwaltet wird, besteht die Möglichkeit, dass schon jemand ein Skript geschrieben hat, das die gesamte Chronik für Git exportiert.
pl: Jeśli twój projekt był dotychczas zarządzany jednym z bardziej znanch systemów, to istnieje duże prawdopodobieństwo, że ktoś napisał już odpowiedni skrypt, który umożliwi ci eksportowanie do git całej historii.

source: Wenn ich Dich versehentlich vergessen habe, sag' mir bitte Bescheid oder schicke mir einfach einen Patch!
pl: Gdybym o tobie przypadkowo zapomniał, daj mi znać albo przyślij mi po prostu patch.

source: Wenn ich doch nur eine Trottelversicherung abgeschlossen hätte, durch Verwendung eines _hook_, der mich bei solchen Problemen alarmiert.
pl: Gdybym tylko zabezpieczył się, stosując prosty _hook_, który alarmowałby przy takich problemach.

source: Wenn ich eine langsame Anweisung auszuführen hatte, wurde durch die Unterbrechung meiner Gedankengänge dem Arbeitsfluss ein unverhältnismäßiger Schaden zugefügt.
pl: Gdy musiałem wykonywać powolne polecenia, z powodu ciągłego przerywanie toku myślenia, zadawałem nieporównywalne szkody dla całego przebiegu pracy.

source: Wenn ich zufrieden bin, 'pushe' ich in das zentrale 'Repository'.
pl: Gdy już jestem zadowolony, 'push' do zentralnego repozytorium.-

source: Wenn ich zur ursprünglichen Arbeit zurückkehrte, war die Operation längst beendet und ich vergeudete noch mehr Zeit beim Versuch mich zu erinnern was ich getan habe.
pl: Gdy wracałem do poprzedniego zajęcia, po zakończeniu komunikacji, dawno straciłem wątek i czas by przypomnieć sobie co właściwie chciałem zrobić.

source: Wenn inzwischen neue Änderungen von anderen Entwicklern beim Hauptserver eingegangen sind, schlägt dein 'push' fehl.
pl: Jeśli w międzyczasie nastąpiły nowe zmiany na serwerze wprowadzone przez innego programistę, twój PUSH nie powiedzie sie.

source: Wenn mehrere 'Branches' mit unterschiedlichen initialen 'Commits' zusammengeführt und dann ein 'Rebase' gemacht wird, ist ein manuelles Eingreifen erforderlich.
pl: Jeśli chcemy scalić kilka 'branches' o różniących sie inicjalnych 'commits' i przeprowadzić 'rebase', musimy ręcznie ingerować.

source: Wenn nicht, ersetzte "bad" mit "good".
pl: Jeśli nie, zamień "bad" na "good".

source: Wenn nicht, kannst Du den Verlauf so umschreiben, dass es so aussieht als hättest Du es:
pl: Jeśli nie, możesz zmienić opis, by wyglądał jakby był twój:

source: Wenn nötig, starte den Git-Dämon:
pl: Jeśli konieczne, wystartuj GIT-DAEMON

source: Wer bin ich?
pl: Kim jestem?

source: Wer ist verantwortlich?
pl: Kto ponosi odpowiedzialność?

source: Wer macht was?
pl: Kto robi co?

source: Wie 'Clonen', 'Branchen' und 'Mergen' ist das Umschreiben der Chronik lediglich eine weitere Stärke, die Git dir bietet.
pl: Tak samo jak 'clone', 'branche' czy 'merge', możliwość zmian korniki historii to tylko kolejna siła, jaką obdarza cię git.

source: Wie Arthur C. Clarke festgestellt hat, ist jede hinreichend fortschrittliche Technologie nicht von Magie zu unterscheiden.
pl: Jak stwierdźił Arthur C. Clarke, każda wystarczająco postępowa technologia jest porównywalna z magią.

source: Wie auch immer, abgesehen von diesem Fall, raten wir vom 'Pushen' in ein 'Repository' ab.
pl: W każdymbądź razie, odradzamy z korzystania z polecenia PUSH do REPOSITORY

source: Wie auch immer, mit Git kannst du nicht viel falsch machen.
pl: Jakby jednak nie spojrzeć, stosując Git nie stanie ci się niz złego.

source: Wie auch immer, vorausgesetzt du hast oft 'comittet', kann Git dir sagen, wo das Problem liegt:
pl: Jakby nie było, pod warunkiem, że często używałeś 'commit', git może ci zdradzić gdzie szukać problemu.

source: Wie du dir vielleicht schon gedacht hast, verwendet Git 'Branches' im Hintergrund um diesen Zaubertrick durchzuführen.
pl: Jak już prawdopodobnie się domyślasz, GIT stosuje BRANCHES w tle, by wykonać tą magiczną sztuczję

source: Wie kann Git so unauffällig sein?
pl: Jak to możliwe, że Git jest taki niepostrzeżony?

source: Wie konnte ich das wissen, ohne den Dateiname zu kennen?
pl: Skąd mogłem to wiedzieć, mimo iż nie znałem nazwy pliku?

source: Wie macht Git das?
pl: Jak Git to robi?

source: Wie mit der ``master'' 'Branch' Konvention können wir diesen Spitznamen ändern oder löschen, aber es gibt für gewöhnlich keinen Grund dies zu tun.
pl: Tak jak i przy konwencji z ``master'' 'Branch' , możemy ten alias zmienić albo skasować, zwykle jednak nie ma powodów by to robić.

source: Wie viele andere Versionsverwaltungssysteme hat Git eine 'blame' Anweisung:
pl: Jak i wiele innych systemów kontroli wersji posiada również i git polecenie 'blame'.

source: Wie vorhin, kannst Du 'zpipe' oder 'cat-file' benutzen um es für Dich zu überprüfen.
pl: Jak i w poprzednich przykładach możesz użyć 'zpipe' albo 'cat-file' by to sprawdzić.

source: Wie würdest du ein System erstellen, bei dem jeder auf einfache Weise die Sicherungen der anderen bekommt?
pl: W jaki sposób skonstruowałbyś taki system, który w prosty sposób jest w stanie otrzymywać archiwa od innych?

source: Wieder andere bevorzugen irgendetwas dazwischen.
pl: Inni znowu wolą coś pomiędzy.

source: Willst Du 'Repositories' ohne Server synchronisieren oder gar ohne Netzwerkverbindung?
pl: Chciałbyś synchronizować repozytoria bez pomocy serwera czy nawet bez użycia sieci komputerowej?

source: Wir befinden uns in letzterem Branch; wir haben `master` erzeugt ohne dorthin zu wechseln, denn wir wollen im `teil2` weiterarbeiten.
pl: Znajdujemy się teraz w tym ostatnim BRANCH; utworzyliśmy MASTER bez wchodzenia do niego, ponieważ mamy zamiar pracować teraz dalej w BRANCH czesc2

source: Wir erstellen einen Schnappschuß einiger, aber nicht aller unser Änderungen im Index und speichern dann diesen sorgfältig zusammengestellten Schnappschuß permanent.
pl: Tworzymy obraz niektórych, jednak nie wszystkich zmian w indeksie i zapamiętujemy trwale starannie dobrany obraz.

source: Wir erwähnen auch kurz Bazaar, weil es nach Git und Mercurial das bekannteste freie verteilte Versionsverwaltungssystem ist.
pl: Wspomnijmy również pokrótce o Bazaar, ponieważ jest to najbardziej popularny darmowy rozproszony system kontroli wersji po Git i Mercurial.

source: Wir haben den Beispiel 'hook' *post-update* aktiviert, weiter oben im Abschnitt Git über HTTP. Dieser läuft immer, wenn der 'HEAD' sich bewegt.
pl: We wcześniejszcm rozdziale "git poprzez http" przytoczyliśmy przykład 'hook' dla *post-update*, który wykonywany jest zawsze, jeśli znacznik 'HEAD' zostaje przesunięty.

source: Wir haben ein Git 'Repository' erstellt, das eine Textdatei mit einer bestimmten Nachricht enthält.
pl: Utworzylismy repozytorium posiadające plik z ta zawartoscia

source: Wir haben früher festgestellt, dass der Index ein Bereitstellungsraum ist.
pl: Stwierdziliśmy już wcześniej, że indeks jest przechowalnią (ang. staging area).

source: Wir haben gesehen, dass man mit <<makinghistory, *git fast-export* und *git fast-import* 'Repositories' in eine einzige Datei konvertieren kann und zurück>>.
pl: Widzieliśmym, że poleceniami <<makinghistory, *git fast-export* i *git fast-import* możemy konwertować całe repozytoria w jeden jedyny plik i spowrotem>>.

source: Wir haben nun zwei von drei Objekten erklärt.
pl: Wytłumaczyliśmy dwa z trzech objektów.

source: Wir können SHA1-Hash-Werte aus Zeichenfolgen generieren, die selbst SHA1-Hash-Werte enthalten.
pl: Możemy generować klucze SHA1 z łańcuchów samych zawierających klucze SHA1.

source: Wir können den 'Commit' von A auf B als Änderung betrachten, die wir rückgängig machen wollen:
pl: Mozemy rowniez COMMIT A na B widziec jako zmiane, ktora mozemy przywrocic

source: Wir können einen 'Patch' erstellen, der diesen Unterschied darstellt und diesen dann auf D anwenden:
pl: Mozemy utworzyc PATCH, ktory pokaze te roznice i nastepnie zastosowac go na D

source: Wir können mehr als ein 'Repository' gleichzeitig beobachten mit:
pl: Możemy obserwować więcej niż jedno reposytorium jednocześnie:

source: Wir können sogar den hinterhältigsten Gegnern widerstehen.
pl: Możemy przetrwać nawet podstępnego przeciwnika.

source: Wir können solche Dateien hin und her schicken um Git 'Repositories' über jedes beliebige Medium zu transportieren, aber ein effizienteres Werkzeug ist *git bundle*.
pl: W ten sposób możemy transportować tego typu pliki za pomocą dowolnego medium, jednak bardziej wydajnym narzędziem jest *git bundle*.

source: Wir können uns den SHA1-Hash-Wert als eindeutige Identnummer des Dateiinhalts vorstellen, was sinngemäß bedeutet, dass die Dateien über ihren Inhalt adressiert werden.
pl: Klucz SHA1 możemy sobie wyobrazić jako niepowtarzalny numer identyfikacyjny zawartości pliku, co oznacza, że pliki adresowane są na podstawie ich zawartości.

source: Wir möchten die Dateien in D wieder hinzufügen, aber nicht in B. Wie machen wir das?
pl: Chcemy teraz te usuniete pliki zrekonstruowac w D, a nie w B. Jak to zrobic?

source: Wir müssen die Datei aus allen 'Commits' entfernen:
pl: Musimy ten plik usunąć ze wszystkich 'commits':

source: Wir müssten uns zuerst in den Server einloggen und dem 'pull'-Befehl die Netzwerkadresse des Computer übergeben, von dem aus wir die Änderungen 'pullen', also abholen wollen.
pl: Musielibyśmy najpierw zalogować się na serwerze i poleceniu PULL przekazać adres IP komputera z którego chcemy sciągnąć pliki.

source: Wir sind mit dieser Anweisung schon in einem früheren Kapitel in Berührung gekommen, als wir das Laden alter Stände besprochen haben.
pl: Spotkalismy sie z tym poleceniem juz we wczesniejszym rozdziale, gdy poruszalismy temat ladowania starych stanow

source: Wir werden später sehen, wie Git diese nutzt um effizient die Datenintegrität zu garantieren.
pl: Zobaczymy później w jaki sposób wykorzystje je Git dla zapewnienia produktywności i integralności danych.

source: Wir werfen einen Blick unter die Motorhaube und erklären, wie Git seine Wunder vollbringt.
pl: Rzućmy spojrzenie pod maskę silnika i wytłumaczymy w jaki sposób Git realizuje swoje cuda.

source: Wird irgendein 'Clone' beschädigt, wird dies dank des kryptographischen 'Hashing' sofort erkannt, sobald derjenige versucht mit anderen zu kommunizieren.
pl: Gdy jakikolwiek klon zostanie uszkodzony, dzięki kryptograficznemu hashowaniu, zostanie to natychmiast rozpoznane, jeśli tylko osoba ta będzie próbować komunikować się z innymi.

source: Wirklich, diese Anweisung kann Klartext-'Repositories' über reine Textkanäle übertragen.
pl: Na prawdę, to polecenie potrafi przekazywać repozytoria za pomocą zwykłego tekstu.

source: Wo ging alles schief?
pl: Gdzie wszystko poszło źle?

source: Wo kommt dieser Fehler her?
pl: Skąd wziął się ten błąd?

source: Wobei SP ein Leerzeichen ist, NUL ist ein Nullbyte und LF ist ein Zeilenumbruch.
pl: Przyczym SP to spacja, NUL - to bajt zerowy, a LF to znak nowej linii ('newline').

source: Woher weiß Git, dass Du eine Datei umbenannt hast, obwohl Du es ihm niemals explizit mitgeteilt hast?
pl: Skąd Git wie o tym, że zmieniłaś nazwę jakiegoś pliku, jeśli nigdy go o tym wyraźnie nie poinformowałaś?

source: Während dem Warten auf das Ende der Serverkommunikation tat ich etwas anderes um die Wartezeit zu überbrücken, zum Beispiel E-Mails lesen oder Dokumentation schreiben.
pl: Podczas oczekiwania na zakończenie komunikacji pomiędzy serwerami dla przeczekania zaczynałem robiłć coś innego, na przykład czytałem maile albo pisałem dokumentację.

source: Während dem ursprünglichen 'clonen', wird sie auf den aktuellen 'Branch' des Quell-'Repository' gesetzt, so dass selbst dann, wenn der 'HEAD' des Quell-'Repository' inzwischen auf einen anderen 'Branch' gewechselt hat, ein späterer 'pull' wird treu dem original 'Branch' folgen.
pl: Podczas początkowego klonowania, zostanie ustawiony na aktualny branch źródłowego repozytorium, że nawet i potym jak 'HEAD' źródłowego repozytorium przejdzie do innego branch, późniejszy 'pull' pozostanie wierny orginalnemu branch.

source: Würde dann zum Beispiel *git log* ausgeführt, würde der Anwender darüber informiert, daß noch keine 'Commits' gemacht wurden, anstelle mit einem fatalen Fehler zu beenden.
pl: Jeśli na przykład użytkownik wykonałby polecenie *git log*, zostałby poinformowany, że nie istnieje jeszcze żaden 'commit', gdzie w obecnym miejscu komenda wywoła błąd.

source: Zeige die entfernten 'Branches' an mit:
pl: Oddalone 'branches' możesz pokazać poprzez:

source: Zentralisierte Systeme schließen es aus offline zu arbeiten und benötigen teurere Netzwerkinfrastruktur, vor allem, wenn die Zahl der Entwickler steigt.
pl: Scentralizowane systemy wykluczają pracę offline i wymagają drogiej infrastruktura sieciowej, w szczególności gdy wzrasta liczba programistów.

source: Zu jedem späteren Zeitpunkt kannst du die Änderungen des Originalprojekts 'mergen' mit:
pl: W każdej późniejszej chwili możesz zmiany oryginalnego projektu MERGEN poprzez:

source: Zu jeder Zeit kannst Du 'comitten' und die Änderungen des anderen Klon 'pullen'.
pl: W każdym momencie możesz COMMITEN i zmiany innego klonu PULLEN

source: Zu link:/~blynn/gitmagic/intl/zh_tw/[Traditionellem Chinesisch] konvertiert via +cconv -f UTF8-CN -t UTF8-TW+.
pl: Do link:/~blynn/gitmagic/intl/zh_tw/[tradycyjny chiński] skonwertowany przez +cconv -f UTF8-CN -t UTF8-TW+.

source: Zuerst ein Zaubertrick.
pl: Na początek magiczna sztuczka

source: Zuerst, 'pull' funktioniert nicht mit 'bare Repositories': stattdessen benutze 'fetch', ein Befehl, den wir später behandeln.
pl: Po pierwsze, ponieważ PULL nie działa z BARE REPOSITORIES: zamiast niego używaj FETCH, polecenie którym zajmiemy się później.

source: Zuletzt, ersetze alle 'Clones' deines Projekts mit deiner überarbeiteten Version, falls du später mit ihnen interagieren möchtest.
pl: Wreszcie zamień wszystkie klony twojego projektu na zaktualizowaną wersję, jeśli masz zamiar prowadzić z nimi wymianę.

source: Zum Beispiel ist *commit -a* eigentlich ein zweistufiger Prozess.
pl: na przykład polecenie *commit -a* jest właściwie procesem dwustopniowym.

source: Zum Beispiel ist `git checkout` schneller als `cp -a` und projektweite Unterschiede sind besser zu komprimieren als eine Sammlung von Änderungen auf Dateibasis.
pl: Na przykład polecenie `git checkout` jest szybsze niż `cp -a`, zmiany w zakresie całego projektu daje się lepiej komprymować niż zbiór zmian na bazie pojedyńczych plików.

source: Zum Beispiel kannst Du einen Klon bearbeiten, während der andere kompiliert wird.
pl: Na przykład możesz pracować nad klonem, podczas gdy drugi jest kompilowany

source: Zum Beispiel wäre es sicher, ihn in einer Zeitung zu veröffentlichen, denn es ist schwer für einen Angreifer jede Zeitungskopie zu manipulieren.
pl: Na przykład można opublikować go w gazecie, ponieważ byłoby dość trudnym zadaniem zmanipulować każdą kopię gazety

source: Zum Beispiel, Englisch ist "en", Japanisch ist "ja".
pl: Na przykład, angielski to "en", a japoński to "ja".

source: Zum Beispiel, angenommen Du hast viele 'Commits' gemacht und möchtest einen Vergleich zur letzten abgeholten Version machen.
pl: Przyjmijmy, na przykład, że wykonałeś wiele COMMITTS i chciałbyś uzyskać porównanie do ostatnio ściągniętej wersji.

source: Zum Beispiel, nehmen wir an, der 'Commit' ``1b6d...'' ist der aktuellste, den beide Parteien haben:
pl: Na przykład załóżmy, że 'commit' ``1b6d...'' jest najaktualniejszym, które posiadają obie partie:

source: Zum Beispiel:
pl: Na przyklad:

source: Zum Glück ist es einfach, Skripte zu schreiben, sodass mit jedem Update das zentrale Git 'Repository' einen Zähler erhöht.
pl: Na szczęście, łatwo jest pisać skrypty, zwiększające stan licznika przy każdyej aktualizacji centralnego repozytorium GIT.

source: Zum Konvertieren gib in einem leeren Verzeichnis ein:
pl: Aby przekonwertować wejść do pustego katalogu:

source: Zusätzlich habe ich mich dabei ertappt, bestimmte Anweisungen zu vermeiden, um die damit verbundenen Wartezeiten zu vermeiden und das hat mich letztendlich davon abgehalten meinem gewohnten Arbeitsablauf zu folgen.
pl: Pozatym sam łapałem sie na tym, że unikałem pewnych poleceń i związanym z nimi czasem oczekiwania, w sumie wszystko to wpływało mocno na wypracowany przeze mnie przebieg prac.

source: Zusätzlich müssen verschiedene Grenzfälle speziell behandelt werden, wie der 'Rebase' eines 'Branch' mit einem abweichenden initialen 'Commit'.
pl: Dodatkowo, różnego rodzaju krańcowe przypadki muszą być traktowane specjalnie, jak 'rebase' dla 'branch' o różniącym sie pierwszym 'commit'.

source: [[branch]] Sagen wir, du arbeitest an einer Funktion und du musst, warum auch immer, drei Versionen zurückgehen um ein paar print Anweisungen einzufügen, damit du siehst, wie etwas funktioniert.
pl: [[branch]] Zalozmy, pracujesz nad jakas funkcja, i musisz, jakiegokolwiek powodu, wrocic o 3 wersje wstecz, by wprowadzic kilka polecen print, aby sprawdzic jej dzialanie.

source: [[makinghistory]] Du möchtest ein Projekt zu Git umziehen?
pl: [[makinghistory]] Masz zamiar przenieść projekt do git?

source: aa823728ea7d592acc69b36875a482cdf3fd5c8d ist.
pl: wynosi właśnie: aa823728ea7d592acc69b36875a482cdf3fd5c8d.
